---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CannotAddMorePolesToCircuit
source: html/6a467701-f6b7-a71d-eba4-3b7c41f4687a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CannotAddMorePolesToCircuit Property

Empty slots are unavailable to hold the number of poles you specified for this spare. \nTo add more poles to this spare, you must free up slots by moving the circuits below the spare.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotAddMorePolesToCircuit { get; }
```